[
  {"topics": ["Limited Size or Shade Availability"], "comment": "Absolutely frustrated! Every time I find something I love, it's sold out in my size. What's the point of having a wishlist if nothing is ever available?"},
  {"topics": ["Difficult Product Discovery"], "comment": "Your search function is terrible. I typed 'red lipstick' and got foundation results. How am I supposed to find anything on this site?"},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "The foundation shade looked completely different online vs what I received. This is the third time this has happened - I'm done with CosmoBrand."},
  {"topics": ["Confusing Loyalty or Discount Systems"], "comment": "I had 500 points and couldn't figure out how to use them. Your loyalty program is unnecessarily complicated and customer service couldn't even explain it properly."},
  {"topics": ["Website or App Bugs"], "comment": "Mobile app crashes every time I try to checkout. I've lost my cart contents multiple times. This is unacceptable in 2025."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "My shade is ALWAYS out of stock. I've been trying to reorder my foundation for 3 weeks now. Time to find a new brand that actually keeps products in stock."},
  {"topics": ["Difficult Product Discovery"], "comment": "The filters don't work properly. I select 'cruelty-free' and still get products that aren't. Your product categorization is a mess."},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "Ordered a 'berry' lip color that arrived as bright orange. The photos on your site are completely misleading. Very disappointed."},
  {"topics": ["Unresponsive or Generic Customer Support"], "comment": "Waited 4 days for a response to my email, only to get a generic copy-paste reply that didn't address my issue at all. Terrible service."},
  {"topics": ["Website or App Bugs"], "comment": "Promo code worked at checkout but didn't apply the discount. Had to contact support multiple times to get it sorted. Your site has serious technical issues."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "Been waiting 6 weeks for a restock notification on my usual concealer shade. This happens with every product I want to repurchase."},
  {"topics": ["Confusing Loyalty or Discount Systems"], "comment": "Thought I qualified for free shipping with my membership but got charged anyway. Your terms and conditions are confusing and misleading."},
  {"topics": ["Slow or Unreliable Shipping"], "comment": "Paid for express shipping and it took 2 weeks to arrive. Customer service just kept giving me tracking updates that didn't match reality."},
  {"topics": ["Difficult Product Discovery"], "comment": "Can't find products by ingredient list. As someone with sensitive skin, this makes shopping here impossible. Your search needs major improvements."},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "The eyeshadow palette colors look nothing like the swatches on your website. This is false advertising at this point."},
  {"topics": ["Website or App Bugs"], "comment": "Cart keeps emptying itself when I switch between pages. I've had to start over 5 times trying to place one order."},
  {"topics": ["Damaged or Incorrect Items"], "comment": "Received a completely shattered compact. Packaging was fine, so this was clearly a quality control issue. Very disappointing."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "Your shade range is pathetic. As a POC, I can never find anything that matches my skin tone. Do better."},
  {"topics": ["Unresponsive or Generic Customer Support"], "comment": "Live chat agent kept asking me to repeat information I'd already provided. Felt like they weren't even reading my messages."},
  {"topics": ["Confusing Loyalty or Discount Systems"], "comment": "Missed out on a 30% off sale because I didn't know I needed to activate my membership discount separately. Your system is needlessly complex."},
  {"topics": ["Difficult Product Discovery"], "comment": "Product recommendations are completely off. I buy skincare and you keep showing me hair products. Your algorithm needs work."},
  {"topics": ["Slow or Unreliable Shipping"], "comment": "International shipping to Canada took over a month. For the prices you charge, this is completely unacceptable."},
  {"topics": ["Website or App Bugs"], "comment": "Desktop site won't let me complete checkout - button just spins endlessly. Had to use a different browser entirely."},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "Product description said 'long-lasting' but the lipstick barely stayed on for an hour. Complete misrepresentation."},
  {"topics": ["Complicated Returns or Exchanges"], "comment": "Return process requires 5 different steps and approval from customer service. Just wanted to exchange a wrong shade - shouldn't be this hard."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "Popular items sell out instantly and take months to restock. Your inventory management is terrible."},
  {"topics": ["Customs and Import Charges"], "comment": "Got hit with unexpected customs fees that doubled my order cost. Should have been disclosed before checkout."},
  {"topics": ["Difficult Product Discovery"], "comment": "Site navigation is confusing. Took me 20 minutes to find the moisturizer section. Needs a complete UX overhaul."},
  {"topics": ["Confusing Loyalty or Discount Systems"], "comment": "Points expired without warning. Nowhere on the site does it clearly state the expiration policy. Lost $50 worth of rewards."},
  {"topics": ["Website or App Bugs"], "comment": "Payment processing fails randomly. Sometimes works, sometimes doesn't. Very frustrating shopping experience."},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "Mascara was supposed to be waterproof but smudged immediately in light rain. Product claims are unreliable."},
  {"topics": ["Unresponsive or Generic Customer Support"], "comment": "Support team doesn't seem trained on your own products. Asked about an ingredient and they had no clue."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "XS sizes are always sold out. Feels like you only stock for average sizes and ignore petite customers."},
  {"topics": ["Slow or Unreliable Shipping"], "comment": "Package got lost twice and customer service acted like it was my fault. Terrible logistics management."},
  {"topics": ["Damaged or Incorrect Items"], "comment": "Ordered nude lipstick, received bright red. Quality control is non-existent. This is basic order fulfillment."},
  {"topics": ["Difficult Product Discovery"], "comment": "Search results are completely random. Looking for 'foundation' brings up nail polish. Makes no sense."},
  {"topics": ["Website or App Bugs"], "comment": "Mobile site constantly redirects to desktop version which doesn't work on phones. Technical incompetence."},
  {"topics": ["Confusing Loyalty or Discount Systems"], "comment": "Spent $200 expecting to hit VIP status but apparently I needed to spend it in one order, not cumulative. Rules are unclear."},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "Serum texture was completely different from description. Said lightweight, received thick cream. Very misleading."},
  {"topics": ["Complicated Returns or Exchanges"], "comment": "Have to pay return shipping for defective products. This should be covered by the company, not the customer."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "New collection launched but half the shades were already sold out on day one. Poor stock planning."},
  {"topics": ["Customs and Import Charges"], "comment": "Shipping to UK resulted in unexpected VAT charges. Website should calculate total cost including taxes upfront."},
  {"topics": ["Unresponsive or Generic Customer Support"], "comment": "Submitted a complaint 2 weeks ago and still no response. Customer service is completely overwhelmed or just ignoring customers."},
  {"topics": ["Difficult Product Discovery"], "comment": "Product pages don't show compatible items or suggestions. Shopping here feels like wandering in the dark."},
  {"topics": ["Website or App Bugs"], "comment": "Checkout process times out frequently, losing all my information. Have to start over each time."},
  {"topics": ["Slow or Unreliable Shipping"], "comment": "Standard shipping took 3 weeks within the same country. Amazon delivers in 2 days - your logistics are stuck in the past."},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "Bronzer shade appeared warm-toned online but arrived cool-toned. Photography and color accuracy are terrible."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "Plus sizes are rarely available and when they are, there's no size variety. Feels discriminatory."},
  {"topics": ["Confusing Loyalty or Discount Systems"], "comment": "Birthday discount didn't work during checkout. Support said it expired but I never received an expiration notice."},
  {"topics": ["Website or App Bugs"], "comment": "Site crashes during every major sale. Can't handle traffic spikes which defeats the purpose of having promotions."},
  {"topics": ["Damaged or Incorrect Items"], "comment": "Palette arrived with 3 broken shades. Packaging was intact so this happened before shipping. Poor quality control."},
  {"topics": ["Difficult Product Discovery"], "comment": "Can't sort by price or customer ratings. Basic e-commerce features are missing from your site."},
  {"topics": ["Unresponsive or Generic Customer Support"], "comment": "Chat bot is useless and getting to a human takes forever. When you finally do, they can't help with anything complex."},
  {"topics": ["Complicated Returns or Exchanges"], "comment": "Return window is only 14 days but shipping takes 10 days. Barely have time to test products before return period expires."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "Medium shades are always out but you have plenty of light and dark. Your stocking algorithm needs work."},
  {"topics": ["Slow or Unreliable Shipping"], "comment": "Expedited shipping cost extra but arrived later than standard shipping from other brands. Complete waste of money."},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "Blush intensity in photos vs reality is completely different. What looks subtle online is clown-like in person."},
  {"topics": ["Website or App Bugs"], "comment": "Wishlist items disappear randomly. Can't keep track of products I want to purchase later."},
  {"topics": ["Customs and Import Charges"], "comment": "Order got held at customs for weeks because of incorrect paperwork from your end. Completely avoidable delay."},
  {"topics": ["Confusing Loyalty or Discount Systems"], "comment": "Triple points promotion didn't apply to my order. Fine print is buried so deep you need a magnifying glass to find exclusions."},
  {"topics": ["Difficult Product Discovery"], "comment": "No way to filter by skin type or concerns. For a beauty brand, this is a fundamental failure."},
  {"topics": ["Unresponsive or Generic Customer Support"], "comment": "Support keeps closing my tickets without resolution. Have to keep reopening the same issue multiple times."},
  {"topics": ["Website or App Bugs"], "comment": "Password reset emails never arrive. Can't access my account and customer service can't help without security verification."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "Sample sizes are never available when I want to try before buying full size. Forces risky purchases."},
  {"topics": ["Damaged or Incorrect Items"], "comment": "Liquid foundation leaked all over other products during shipping. Poor packaging design ruined my entire order."},
  {"topics": ["Slow or Unreliable Shipping"], "comment": "Tracking information is never accurate. Package shows as delivered but arrives 3 days later."},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "Concealer coverage was described as full but barely covers anything. Product performance claims are exaggerated."},
  {"topics": ["Complicated Returns or Exchanges"], "comment": "Need original packaging to return but your packaging is designed to be opened destructively. Catch-22 situation."},
  {"topics": ["Confusing Loyalty or Discount Systems"], "comment": "Member-exclusive early access didn't work for my account. Support said I'm not eligible but never explained why."},
  {"topics": ["Difficult Product Discovery"], "comment": "New arrivals section hasn't been updated in months. How am I supposed to discover your latest products?"},
  {"topics": ["Website or App Bugs"], "comment": "Product reviews don't load half the time. Can't make informed decisions without seeing other customers' experiences."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "Restock notifications never work. Sign up to be notified but never receive emails when items come back."},
  {"topics": ["Unresponsive or Generic Customer Support"], "comment": "Phone support has 45+ minute wait times. By the time someone answers, I've forgotten why I called."},
  {"topics": ["Customs and Import Charges"], "comment": "Charged duties on a return shipment. Having to pay to send back your defective product is insulting."},
  {"topics": ["Slow or Unreliable Shipping"], "comment": "Rural delivery takes twice as long as promised. Your shipping partners clearly don't prioritize smaller locations."},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "Skin tone in model photos doesn't match mine but product was recommended for my complexion. Very misleading marketing."},
  {"topics": ["Website or App Bugs"], "comment": "App notifications for sales never work. Miss out on deals because your push notifications are broken."},
  {"topics": ["Difficult Product Discovery"], "comment": "Trending section shows the same products for months. Algorithm seems completely static and unhelpful."},
  {"topics": ["Confusing Loyalty or Discount Systems"], "comment": "Stacked a member discount with a promo code but only one applied. Rules about combining offers are unclear."},
  {"topics": ["Damaged or Incorrect Items"], "comment": "Pressed powder arrived completely pulverized. This keeps happening - you need better protective packaging."},
  {"topics": ["Limited Size or Shade Availability"], "comment": "Travel sizes sell out faster than full sizes but aren't restocked as frequently. Poor inventory balance."},
  {"topics": ["Complicated Returns or Exchanges"], "comment": "Exchange process requires me to place a new order and wait for refund. Why can't you just swap the items directly?"},
  {"topics": ["Unresponsive or Generic Customer Support"], "comment": "Social media team responds faster than official customer service. That's backwards and unprofessional."},
  {"topics": ["Website or App Bugs"], "comment": "Saved payment methods keep getting deleted. Have to re-enter card details for every single order."},
  {"topics": ["Slow or Unreliable Shipping"], "comment": "Premium shipping costs more than the product but still takes a week. What exactly am I paying premium for?"},
  {"topics": ["Inaccurate Product Descriptions or Photos"], "comment": "Shimmer eyeshadow looked subtle online but it's pure glitter bomb. Completely unusable for everyday wear."},
  {"topics": ["Limited Size or Shade Availability", "Confusing Loyalty or Discount Systems"], "comment": "My VIP early access to new shades is useless because everything sells out before I can use my member discount. Poor coordination between teams."},
  {"topics": ["Difficult Product Discovery", "Website or App Bugs"], "comment": "Search function crashes when I try to use multiple filters. Can't find anything specific on this broken site."},
  {"topics": ["Inaccurate Product Descriptions or Photos", "Damaged or Incorrect Items"], "comment": "Ordered matte lipstick but received glossy formula, and it was already used! Quality control and accuracy are both terrible."},
  {"topics": ["Unresponsive or Generic Customer Support", "Complicated Returns or Exchanges"], "comment": "Support won't process my return because they claim I'm past the deadline, but they took 5 days to respond to my initial request. Circular logic."},
  {"topics": ["Website or App Bugs", "Slow or Unreliable Shipping"], "comment": "Order confirmation email never arrived, so I placed the order twice. Now I have duplicates and your shipping is too slow to cancel the second order."},
  {"topics": ["Limited Size or Shade Availability", "Difficult Product Discovery"], "comment": "Can't filter by available sizes only, so I waste time browsing sold-out items. Your site shows me what I can't buy."},
  {"topics": ["Confusing Loyalty or Discount Systems", "Website or App Bugs"], "comment": "Points balance shows different amounts on mobile vs desktop. Can't trust your system to track rewards properly."},
  {"topics": ["Inaccurate Product Descriptions or Photos", "Unresponsive or Generic Customer Support"], "comment": "Foundation oxidized to orange but support insists it's 'normal color variation.' Photos on site don't show this happening."},
  {"topics": ["Customs and Import Charges", "Slow or Unreliable Shipping"], "comment": "International order took 6 weeks and came with surprise fees that weren't disclosed. Shipping experience is awful for overseas customers."},
  {"topics": ["Damaged or Incorrect Items", "Complicated Returns or Exchanges"], "comment": "Broken compact arrived but return process requires photos, receipts, and manager approval. Just send me a replacement - it's obviously defective."},
  {"topics": ["Limited Size or Shade Availability", "Inaccurate Product Descriptions or Photos"], "comment": "Shade matching tool recommended a color that's permanently out of stock. Why suggest unavailable products?"},
  {"topics": ["Difficult Product Discovery", "Confusing Loyalty or Discount Systems"], "comment": "Member-exclusive products are impossible to find on the site. If I can't locate them, what's the point of VIP access?"},
  {"topics": ["Website or App Bugs", "Unresponsive or Generic Customer Support"], "comment": "App keeps logging me out mid-checkout. Support says it's my phone's fault but it only happens on your app."},
  {"topics": ["Slow or Unreliable Shipping", "Damaged or Incorrect Items"], "comment": "Package arrived late and half the products were missing. Your logistics are completely broken."},
  {"topics": ["Inaccurate Product Descriptions or Photos", "Customs and Import Charges"], "comment": "Product weight was wrong on customs forms, causing additional fees. Even your international documentation is inaccurate."},
  {"topics": ["Confusing Loyalty or Discount Systems", "Complicated Returns or Exchanges"], "comment": "Can't use reward points on sale items, and can't return items bought with points. Your policies are designed to trap customers."},
  {"topics": ["Limited Size or Shade Availability", "Website or App Bugs", "Unresponsive or Generic Customer Support"], "comment": "Restock notification system is broken, customer service can't fix it, and my shade has been out of stock for 2 months. Triple failure."},
  {"topics": ["Difficult Product Discovery", "Inaccurate Product Descriptions or Photos", "Slow or Unreliable Shipping"], "comment": "Spent forever finding a product, description was wrong, and shipping took 3 weeks. Every aspect of shopping here is problematic."},
  {"topics": ["Website or App Bugs", "Confusing Loyalty or Discount Systems", "Damaged or Incorrect Items"], "comment": "Loyalty points didn't apply due to site glitch, and when the wrong item arrived, I lost the points entirely. System is completely unreliable."}
]